hazy1k/STC8051_Smart-Car/6.参考资料与拓展/4.单片机相关资料/IAP资料/ARM IAP/LPC ARM IAP/IAP/LPC213XDEF.H
#define LPC_BASE_WDT  ((LPCPS_WDT)  0xE0000000)//定义硬件结构指针（硬件地址）
const LPCPS_WDT WDT = LPC_BASE_WDT;//定义全局结构指针变量WDT

typedef struct _LPCS_ADC {
  LPC_REG ADCR; //A/D 控制寄存器
  LPC_REG ADDR; //A/D 数据寄存器
  LPC_REG AD_GSR;//A/D 全局启动寄存器
}LPCS_ADC, *LPCPS_ADC;

#define LPC_BASE_ADC0  ((LPCPS_ADC)  0xE0034000)//定义硬件结构指针（硬件地址）
#define LPC_BASE_ADC1  ((LPCPS_ADC)  0xE0060000)//定义硬件结构指针（硬件地址）
const LPCPS_ADC ADC0 = LPC_BASE_ADC0;//定义全局结构指针变量ADC0
const LPCPS_ADC ADC1 = LPC_BASE_ADC1;//定义全局结构指针变量ADC1

typedef struct _LPCS_INTCON {
  LPC_REG EXT_INT;//外部中断标志寄存器
  LPC_REG INT_WAKE;//外部中断唤醒寄存器
  LPC_REG EXT_MODE;//外部中断方式寄存器
  LPC_REG EXT_POLAR;//外部中断极性寄存器
}LPCS_INTCON, *LPCPS_INTCON;

#define LPC_BASE_INTCON  ((LPCPS_INTCON)  0xE01FC140)//定义硬件结构指针（硬件地址）
const LPCPS_INTCON INTCON = LPC_BASE_INTCON;//定义全局结构指针变量INTCON

typedef struct _LPCS_POWER {
  LPC_REG P_CON;//功率控制寄存器
  LPC_REG P_CONP;//外部功率控制寄存器
}LPCS_POWER, *LPCPS_POWER;

#define LPC_BASE_POWER  ((LPCPS_POWER)  0xE01FC0C0)//定义硬件结构指针（硬件地址）
const LPCPS_POWER POWER = LPC_BASE_POWER;//定义全局结构指针变量INTCON

typedef struct _LPCS_SYSCON {
  LPC_REG MEM_MAP;//存储器映射控制     //0xE01FC040
  LPC_REG Reserved0[15]; //保留16个空位 //0xE01FC044
  LPC_REG PLL_CON;//PLL 控制寄存器  //0xE01FC080
  LPC_REG PLL_CFG;//PLL 配置寄存器  //0xE01FC084
  LPC_REG PLL_STAT;//PLL 状态寄存器  //0xE01FC088
  LPC_REG PLL_FEED;//PLL 愦送寄存器  //0xE01FC08C
  LPC_REG Reserved1[12]; //保留4个空位 //0xE01FC090
  LPC_REG P_CON;//功率控制寄存器  //0xE01FC0C0
  LPC_REG P_CONP;//外部功率控制寄存器 //0xE01FC0C4
  LPC_REG Reserved2[14]; //保留14个空位 //0xE01FC0C8
  LPC_REG VPB_DIV;//VPB 分频器控制寄存器//0xE01FC100
  LPC_REG Reserved3[15]; //保留15个空位 //0xE01FC104
  LPC_REG EXT_INT;//外部中断标志寄存器 //0xE01FC140
  LPC_REG INT_WAKE;//外部中断唤醒寄存器 //0xE01FC144
  LPC_REG EXT_MODE;//外部中断方式寄存器 //0xE01FC148
  LPC_REG EXT_POLAR;//外部中断极性寄存器//0xE01FC14C
  LPC_REG Reserved4[12]; //保留12个空位 //0xE01FC150
  LPC_REG RS_ID;//复位源识别寄存器  //0xE01FC180
  LPC_REG CS_PR;//代码安全保护寄存器 //0xE01FC184
}LPCS_SYSCON, *LPCPS_SYSCON;

#define LPC_BASE_SYSCON  ((LPCPS_SYSCON)  0xE01FC040)//定义硬件结构指针（硬件地址）
const LPCPS_SYSCON SYSCON = LPC_BASE_SYSCON;//定义全局结构指针变量SYSCON

#define IAP_FCCLK            11059

/* 定义IAP命令字 */
                                    //   命令           参数
#define     IAP_SELECTOR        50  // 选择扇区     【起始扇区号、结束扇区号】
#define     IAP_RAMTOFLASH      51  // 拷贝数据     【FLASH目标地址、RAM源地址、写入字节数、系统时钟频率】
#define     IAP_ERASESECTOR     52  // 擦除扇区     【起始扇区号、结束扇区号、系统时钟频率】
#define     IAP_BLANKCHK        53  // 查空扇区     【起始扇区号、结束扇区号】
#define     IAP_READPARTID      54  // 读器件ID     【无】
#define     IAP_BOOTCODEID      55  // 读Boot版本号 【无】
#define     IAP_COMPARE         56  // 比较命令     【Flash起始地址、RAM起始地址、需要比较的字节数】
#define     IAP_EXEC            57

/* 定义IAP返回状态字 */
#define     CMD_SUCCESS          __0
#define     INVALID_COMMAND      __1
#define     SRC_ADDR_ERROR       __2 
#define     DST_ADDR_ERROR       __3
#define     SRC_ADDR_NOT_MAPPED  __4
#define     DST_ADDR_NOT_MAPPED  __5
#define     COUNT_ERROR          __6
#define     INVALID_SECTOR       __7
#define     SECTOR_NOT_BLANK     __8
#define     SECTOR_NOT_PREPARED_FOR_WRITE_OPERATION __9
#define     COMPARE_ERROR        __10
#define     BUSY                 __11

#define IAP_LOCATION 0x7ffffff1//IAP函数入口地址
typedef void(*IAP)(unsigned int[], unsigned int[]);//IAP函数指针类型

#define Device_LPC2131  0x0002ff01// 196353
#define Device_LPC2132  0x0002ff11// 196369
#define Device_LPC2134  0x0002ff12// 196370
#define Device_LPC2136  0x0002ff23// 196387
#define Device_LPC2138  0x0002ff25// 196389


#endif  // __LPC213xDEF_H

